XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>K32L3A60_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for K32L3A60</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="17.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.0.0" date="2022-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.1.0" date="2021-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
    <release version="13.0.0" date="2021-02-05">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0 with restructured startup component files</release>
    <release version="12.3.0" date="2021-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.9.0</release>
    <release version="12.2.0" date="2020-07-20">NXP CMSIS Packs based on MCUXpresso SDK 2.8.0</release>
    <release version="12.1.0" date="2019-12-19">NXP CMSIS Packs based on MCUXpresso SDK 2.7.0</release>
    <release version="12.0.0" date="2019-08-16">NXP CMSIS packs based on MCUXpresso SDK 2.6.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.8.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="K32L3A60" Dvendor="NXP:11">
      <description>NXP’s Energy Efficient Cortex-M4 MCU with Cortex-M0+ and Advanced Security</description>
      <device Dname="K32L3A60xxx">
        <processor Pname="cm0plus" Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="72000000"/>
        <processor Pname="cm4" Dcore="Cortex-M4" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="72000000"/>
        <environment Pname="cm0plus" name="iar">
          <file category="linkerfile" name="devices/K32L3A60/iar/K32L3A60xxx_cm0plus_flash.icf"/>
        </environment>
        <environment Pname="cm4" name="iar">
          <file category="linkerfile" name="devices/K32L3A60/iar/K32L3A60xxx_cm4_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" start="0x48000000" size="0x1000" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH_cm0plus" start="0x01000000" size="0x040000" access="rx" default="1"/>
        <memory name="PROGRAM_FLASH_cm4" start="0x00000000" size="0x100000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_DTC_cm4" start="0x20000000" size="0x030000" access="rw" default="1"/>
        <memory name="SRAM_ITC_cm4" start="0x08000000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM_TCM_cm0plus" start="0x09000000" size="0x020000" access="rw" default="1"/>
        <memory name="USB_RAM" start="0x48010000" size="0x0800" access="rw" default="1"/>
        <algorithm name="devices/K32L3A60/arm/K32L3A60_P1024_4KB_SEC.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00002000" default="1"/>
        <algorithm name="devices/K32L3A60/arm/K32L3A60_P256_2KB_SEC.FLM" start="0x01000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00002000" default="1"/>
        <debug svd="devices/K32L3A60/K32L3A60_cm0plus.xml" Pname="cm0plus" __dp="0" __ap="1"/>
        <debug svd="devices/K32L3A60/K32L3A60_cm4.xml" Pname="cm4" __dp="0" __ap="0"/>
        <variant Dvariant="K32L3A60VPJ1A">
          <compile Pname="cm0plus" header="devices/K32L3A60/fsl_device_registers.h" define="CPU_K32L3A60VPJ1A_cm0plus"/>
          <compile Pname="cm4" header="devices/K32L3A60/fsl_device_registers.h" define="CPU_K32L3A60VPJ1A_cm4"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device_id.K32L3A60xxx.internal_condition">
      <accept Dname="K32L3A60VPJ1A" Dvendor="NXP:11"/>
    </condition>
    <condition id="DEVICES_Project_Template.K32L3A60.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=K32L3A60xxx, device.K32L3A60_startup, driver.clock, driver.common, driver.gpio, driver.lpi2c, driver.lpuart, driver.msmc, driver.port, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=K32L3A60xxx, device.K32L3A60_startup, driver.clock, driver.common, driver.gpio, driver.lpi2c, driver.lpuart, driver.msmc, driver.port, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="msmc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require condition="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
