XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <condition id="device.K32L3A60_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=K32L3A60.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="allOf.cores=cm4f.condition_id">
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="cores.cm4f.internal_condition">
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="device.K32L3A60_linker.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L3A60xxx.internal_condition">
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="device_ids.K32L3A60xxx.internal_condition">
      <accept Dname="K32L3A60VPJ1A" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm0p, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm0p, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm0p, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm4f, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm4f, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm4f, device_ids=K32L3A60xxx.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
      <require condition="device_ids.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="device.K32L3A60_startup.condition_id">
      <require condition="allOf.device.K32L3A60_system, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L3A60_system, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L3A60_system"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm0p.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm4f.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm0p.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm4f.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm0p.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm4f.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm4f.internal_condition"/>
    </condition>
    <condition id="device.K32L3A60_system.condition_id">
      <require condition="allOf.device.K32L3A60_CMSIS, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L3A60_CMSIS, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L3A60_header"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.cache_lpcac.condition_id">
      <require condition="allOf.core=cm4f, device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm4f, device_id=K32L3A60xxx, driver.common.internal_condition">
      <require condition="core.cm4f.internal_condition"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.cache_lplmem.condition_id">
      <require condition="allOf.core=cm0p, device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
