XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <condition id="allOf.core=cm0p, device_id=K32L3A60xxx, driver.common.internal_condition">
      <require condition="core.cm0p.internal_condition"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="core.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.cau3.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L3A60xxx, driver.common.internal_condition">
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.driver.lpi2c_edma, device_id=K32L3A60xxx, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c_edma, device_id=K32L3A60xxx, driver.lpi2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.driver.lpspi_edma, device_id=K32L3A60xxx, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi_edma, device_id=K32L3A60xxx, driver.lpspi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_edma, device_id=K32L3A60xxx, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_edma, device_id=K32L3A60xxx, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.K32L3A60_CMSIS, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.K32L3A60_CMSIS, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L3A60_header"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p, cm4f.condition_id">
      <require condition="cores.cm0p, cm4f.internal_condition"/>
    </condition>
    <condition id="cores.cm0p, cm4f.internal_condition">
      <accept Dcore="Cortex-M0+"/>
      <accept Dcore="Cortex-M4"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dac_1.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L3A60xxx, driver.common, driver.dmamux.internal_condition">
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.flexbus.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_spi, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_spi, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
