XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_uart, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_uart, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=K32L3A60.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.intmux.condition_id">
      <require condition="allOf.core=cm0p, device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpi2c, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpi2c, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.lpit.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpspi, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpspi, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.driver.edma, driver.lpuart, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.lpuart, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.mmdvsq.condition_id">
      <require condition="allOf.core=cm0p, device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.msmc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mu.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.nand_flash-common.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-common.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-controller-lpspi.condition_id">
      <require condition="allOf.driver.nor_flash-common, driver.lpspi, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.driver.nor_flash-common, driver.lpspi, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
