XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.driver.sai, device_id=K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai, device_id=K32L3A60xxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.sema42.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_emvsim.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, anyOf=device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L3A60xxx, anyOf=device_id=K32L3A60xxx, driver.common.internal_condition">
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require condition="anyOf.device_id=K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.device_id=K32L3A60xxx.internal_condition">
      <accept condition="device_id.K32L3A60xxx.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_emvsim.condition_id">
      <require condition="allOf.driver.smartcard_emvsim, device_id=K32L3A60xxx, anyOf=device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.driver.smartcard_emvsim, device_id=K32L3A60xxx, anyOf=device_id=K32L3A60xxx, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require condition="anyOf.device_id=K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.spm.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.trgmux.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.trng.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.tstmr.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.usdhc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.vref.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.wdog32.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.xrdc.condition_id">
      <require condition="allOf.device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=K32L3A60.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L3A60.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=K32L3A60.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=K32L3A60xxx, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=K32L3A60xxx, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.K32L3A60xxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
