XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="K32L3A60_header" Cversion="1.0.0" condition="device.K32L3A60_CMSIS.condition_id">
      <description>Device K32L3A60_cmsis</description>
      <files>
        <file category="header" name="devices/K32L3A60/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L3A60/K32L3A60_cm0plus.h" projectpath="device"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L3A60/K32L3A60_cm0plus_features.h" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="header" name="devices/K32L3A60/K32L3A60_cm4.h" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="header" name="devices/K32L3A60/K32L3A60_cm4_features.h" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="include" name="devices/K32L3A60/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="K32L3A60_linker" Cversion="1.0.0" condition="device.K32L3A60_linker.condition_id">
      <description>Device K32L3A60_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/arm/K32L3A60xxx_cm0plus_flash.scf" version="1.0.0" projectpath="K32L3A60/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/arm/K32L3A60xxx_cm0plus_ram.scf" version="1.0.0" projectpath="K32L3A60/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/gcc/K32L3A60xxx_cm0plus_flash.ld" version="1.0.0" projectpath="K32L3A60/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/gcc/K32L3A60xxx_cm0plus_ram.ld" version="1.0.0" projectpath="K32L3A60/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/iar/K32L3A60xxx_cm0plus_flash.icf" version="1.0.0" projectpath="K32L3A60/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm0p, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/iar/K32L3A60xxx_cm0plus_ram.icf" version="1.0.0" projectpath="K32L3A60/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/arm/K32L3A60xxx_cm4_flash.scf" version="1.0.0" projectpath="K32L3A60/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/arm/K32L3A60xxx_cm4_ram.scf" version="1.0.0" projectpath="K32L3A60/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/gcc/K32L3A60xxx_cm4_flash.ld" version="1.0.0" projectpath="K32L3A60/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/gcc/K32L3A60xxx_cm4_ram.ld" version="1.0.0" projectpath="K32L3A60/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/iar/K32L3A60xxx_cm4_flash.icf" version="1.0.0" projectpath="K32L3A60/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=K32L3A60xxx.condition_id" category="linkerScript" attr="config" name="devices/K32L3A60/iar/K32L3A60xxx_cm4_ram.icf" version="1.0.0" projectpath="K32L3A60/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.1.0" condition="device.K32L3A60_startup.condition_id">
      <description>Device K32L3A60_startup</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm0p.condition_id" category="sourceAsm" attr="config" name="devices/K32L3A60/arm/startup_K32L3A60_cm0plus.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f.condition_id" category="sourceAsm" attr="config" name="devices/K32L3A60/arm/startup_K32L3A60_cm4.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, cores=cm0p.condition_id" category="sourceAsm" name="devices/K32L3A60/gcc/startup_K32L3A60_cm0plus.S" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f.condition_id" category="sourceAsm" name="devices/K32L3A60/gcc/startup_K32L3A60_cm4.S" projectpath="startup"/>
        <file condition="allOf.toolchains=iar, cores=cm0p.condition_id" category="sourceAsm" attr="config" name="devices/K32L3A60/iar/startup_K32L3A60_cm0plus.s" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=iar, cores=cm4f.condition_id" category="sourceAsm" attr="config" name="devices/K32L3A60/iar/startup_K32L3A60_cm4.s" version="1.1.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="K32L3A60_system" Cversion="1.0.0" condition="device.K32L3A60_system.condition_id">
      <description>Device K32L3A60_system</description>
      <files>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/K32L3A60/system_K32L3A60_cm0plus.c" projectpath="device"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L3A60/system_K32L3A60_cm0plus.h" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="sourceC" name="devices/K32L3A60/system_K32L3A60_cm4.c" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="header" name="devices/K32L3A60/system_K32L3A60_cm4.h" projectpath="device"/>
        <file condition="allOf.cores=cm4f.condition_id" category="include" name="devices/K32L3A60/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lpcac" Cversion="2.1.1" condition="driver.cache_lpcac.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/cm4/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/cm4/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/cm4/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lplmem" Cversion="2.1.1" condition="driver.cache_lplmem.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/cm0plus/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/cm0plus/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/cm0plus/"/>
      </files>
    </component>
