XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cau3" Cversion="2.0.5" condition="driver.cau3.condition_id">
      <description>CAU3 Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_cau3.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_cau3.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.2.1" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.4.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.9.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.5.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p, cm4f.condition_id" category="sourceC" name="devices/K32L3A60/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p, cm4f.condition_id" category="header" name="devices/K32L3A60/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.1.2" condition="driver.dac_1.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.0" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.3" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.3" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.1.3" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexbus" Cversion="2.1.1" condition="driver.flexbus.condition_id">
      <description>FLEXBUS Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_flexbus.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_flexbus.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
