XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.5.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.1" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpit" Cversion="2.1.1" condition="driver.lpit.condition_id">
      <description>LPIT Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpit.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpit.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.6.6" condition="driver.lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.2" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr" Cversion="2.2.0" condition="driver.lptmr.condition_id">
      <description>LPTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lptmr.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lptmr.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.7.6" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mmdvsq" Cversion="2.0.3" condition="driver.mmdvsq.condition_id">
      <description>MMDVSQ Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_mmdvsq.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_mmdvsq.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="msmc" Cversion="2.1.2" condition="driver.msmc.condition_id">
      <description>MSMC Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_msmc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_msmc.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mu" Cversion="2.1.3" condition="driver.mu.condition_id">
      <description>MU Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_mu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_mu.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
