XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L3A60_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common" Cversion="1.0.0" condition="driver.nand_flash-common.condition_id">
      <description>Driver nand_flash-common</description>
      <files>
        <file category="header" name="components/flash/nand/fsl_nand_flash.h" projectpath="nand_flash"/>
        <file category="include" name="components/flash/nand/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common" Cversion="1.0.0" condition="driver.nor_flash-common.condition_id">
      <description>Driver nor_flash-common</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-controller-lpspi" Cversion="1.0.0" condition="driver.nor_flash-controller-lpspi.condition_id">
      <description>Driver nor_flash-controller-lpspi</description>
      <files>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.c" projectpath="nor_flash"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.h" projectpath="nor_flash"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c" projectpath="nor_flash"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/lpspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="header" name="components/pf1550/fsl_pf1550.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550.c" projectpath="pmic_driver"/>
        <file category="header" name="components/pf1550/fsl_pf1550_charger.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550_charger.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="header" name="components/pf3000/fsl_pf3000.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf3000/fsl_pf3000.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.4.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.3.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.2" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.0" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sema42" Cversion="2.0.4" condition="driver.sema42.condition_id">
      <description>SEMA42 Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_sema42.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_sema42.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.1.3" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim" Cversion="2.3.0" condition="driver.smartcard_emvsim.condition_id">
      <description>SMARTCARD EMVSIM Driver</description>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_smartcard.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L3A60/drivers/fsl_smartcard_emvsim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_smartcard_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_phy_emvsim" Cversion="2.3.0" condition="driver.smartcard_phy_emvsim.condition_id">
      <description>SMARTCARD PHY EMVSIM, use only one SMARTCARD PHY in the project</description>
      <RTE_Components_h>
#ifndef USING_PHY_EMVSIM
#define USING_PHY_EMVSIM 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="devices/K32L3A60/drivers/fsl_smartcard_phy.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L3A60/drivers/fsl_smartcard_phy_emvsim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L3A60/drivers/"/>
      </files>
    </component>
